add to various sections notes
